# Задание 6

a = 1
b = 10
i = 1

while a < b:
    a = a*1.1
    i += 1

print(f'При увеличении ежедневного результата пробежки на 10%, спортсмен дойдет до планки с 1 до 10 км в день за {i} дней.')