# Задание 1
# Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

task1 = 'Мое первое задание на курсе Основы языка Python'
task1_1 = 'Вторая переменная'
print(task1)
print(task1_1)

a = input('Введите Ваше имя: ')
b = int(input('Введите Ваш возраст: '))

print(f'Привет {a}. Тебе {b} год(а).')