# task 1

"""Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""

result_list = [2, 'text', 456, 45.3, None]
print(type(result_list[0]))
print(type(result_list[1]))
print(type(result_list[2]))
print(type(result_list[3]))
print(type(result_list[4]))
